---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.FileExportingEventArgs
source: html/d9342751-118d-6119-c685-52603740809d.htm
---
# FileExportingEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.